cs546/hw2/hw2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>cs546 hw2 Shared Memory Programming</title>
<!-- 2017-10-04 Wed 13:24 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Christopher Hannon" />
<link rel="stylesheet" type="text/css" href="../css/notebook.css" />


</head>
<body>
<div id="content">
<h1 class="title">cs546 hw2 Shared Memory Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">How to install</a></li>
<li><a href="#sec-2">Usage</a></li>
<li><a href="#sec-3">Algorithms</a>
<ul>
<li><a href="#sec-3-1">Sequential</a></li>
<li><a href="#sec-3-2">Pthreads 1</a></li>
<li><a href="#sec-3-3">Pthreads 2</a></li>
<li><a href="#sec-3-4">OpenMP</a></li>
</ul>
</li>
<li><a href="#sec-4">References:</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">How to install</h2>
<div class="outline-text-2" id="text-1">
<p>
gcc -pthread -fopenmp -o dle ./dle.c
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
./dle mode size_of_N
</p>
<ul class="org-ul">
<li>Where mode = 0-3
</li>
<li>0 - sequential
</li>
<li>1 - pthreads
</li>
<li>2 - openmp
</li>
<li>3 - Test all (not implemented)
</li>
<li>and N = [1-1000] the size of the matrix A
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Algorithms</h2>
<div class="outline-text-2" id="text-3">
<p>
Additional information on how the algorithms work can be found in the comments in the source file.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Sequential</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The sequential implementation is done using only one thread with no parallelism as a baseline to compare the parallel implemenations with.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Pthreads 1</h3>
<div class="outline-text-3" id="text-3-2">
<p>
In the first implementation of pthreads algorithm there are N-1 rounds.
 In each round N-1-#elapsed_rounds pthreads are created. 
 Each pthread eliminates one column of one row.
 After completion, the main thread waits for each pthread to return. 
 In each round one element in A is reduced to 0 in each row.
 The running time is O(N^3/p).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">x x x x x</td>
</tr>

<tr>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
</tr>

<tr>
<td class="left">x x x x x</td>
<td class="left">&#x2013;&gt;</td>
<td class="left">o x x x x</td>
<td class="left">&#x2013;&gt;</td>
<td class="left">o o x x x</td>
<td class="left">&#x2013;&gt;</td>
<td class="left">o o x x x</td>
<td class="left">&#x2013;&gt;</td>
<td class="left">o o x x x</td>
</tr>

<tr>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o o x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o o x x</td>
</tr>

<tr>
<td class="left">x x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o x x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o x x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o o x x</td>
<td class="left">&#xa0;</td>
<td class="left">o o o o x</td>
</tr>

<tr>
<td class="left">0</td>
<td class="left">&#xa0;</td>
<td class="left">1</td>
<td class="left">&#xa0;</td>
<td class="left">2</td>
<td class="left">&#xa0;</td>
<td class="left">3</td>
<td class="left">&#xa0;</td>
<td class="left">4</td>
</tr>
</tbody>
</table>

<p>
Empirical data shows on Darwin ccs-s03.lanl.gov 15.6.0 Darwin Kernel Version 15.6.0
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">N</th>
<th scope="col" class="left">1</th>
<th scope="col" class="left">10</th>
<th scope="col" class="left">50</th>
<th scope="col" class="left">100</th>
<th scope="col" class="left">500</th>
<th scope="col" class="left">700</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">avg_time_pthreads</td>
<td class="left">0.017 ms</td>
<td class="left">2.1 ms</td>
<td class="left">39 ms</td>
<td class="left">153 ms</td>
<td class="left">4100 ms</td>
<td class="left">8650 ms</td>
</tr>

<tr>
<td class="left">avg_time_seq</td>
<td class="left">0.017 ms</td>
<td class="left">0.067 ms</td>
<td class="left">0.95 ms</td>
<td class="left">5.2 ms</td>
<td class="left">192 ms</td>
<td class="left">470 ms</td>
</tr>
</tbody>
</table>


<p>
The benefit to this approach is that since each pthread is responsible for one row there is no issues with two threads accessing the same memory.
 On the other hand the problem with this approach is that too many threads are created and destroyed.
 This overhead outweighs the gains in parallelism.
 Another issue with this approach is that the max size of N is 700 on my iMac due to the max user processes soft limit i.e., ulimit -a shows (-u) 709.
 A better approach is to keep N-1 threads alive with semaphores to acknowledge when a thread can move to the next column.
 Addtitionally N should be able to be larger than 'max user processes'. 
 A solution to this problem is to operate on the first 'max user processes' rows at a time.
 Once a thread exits a new thread can be created. 
 A thread pool manager can exist to create threads as they exit for maximum performance.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Pthreads 2</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Unfortunetly, Mac OSX does not support unnamed semaphores so we need to move to Linux to use them.
 On the Debian Machine Linux falcon 3.16.0-4-amd64 #1 SMP Debian 3.16.39-1+deb8u1 
 we can use unammed semaphores to block pthreads from eliminating column values prematurely.
 We can have the jth rows pthreade unlock the jth semaphore so that j+1 &#x2013;&gt; N pthreads can eliminate the jth column of their rows.
 The 0th semaphore starts unlocked.
 Pthreads check the value of the semaphore using sem_getvalue in an endless loop. 
 Semaphores are set to 0 by default and raised to 1 when they are 'unlocked'.
 This method avoids the over-creation of pthreads while maintaining correctness.
</p>

<p>
Empirical data shows on Linux falcon 3.16.0-4-amd64 #1 SMP Debian 3.16.39-1+deb8u1
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">N</th>
<th scope="col" class="left">1</th>
<th scope="col" class="left">10</th>
<th scope="col" class="left">50</th>
<th scope="col" class="left">100</th>
<th scope="col" class="left">500</th>
<th scope="col" class="left">700</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">avg_time_pthreads 2</td>
<td class="left">0.0002 s</td>
<td class="left">0.035 s</td>
<td class="left">0.87 s</td>
<td class="left">3.31 s</td>
<td class="left">50.2 s</td>
<td class="left">94.8 s</td>
</tr>

<tr>
<td class="left">avg_time_pthreads 1</td>
<td class="left">0.017 ms</td>
<td class="left">2.1 ms</td>
<td class="left">39 ms</td>
<td class="left">153 ms</td>
<td class="left">4100 ms</td>
<td class="left">8650 ms</td>
</tr>

<tr>
<td class="left">avg_time_seq</td>
<td class="left">0.0002 s</td>
<td class="left">0.0006 s</td>
<td class="left">0.0038 s</td>
<td class="left">0.0135 s</td>
<td class="left">0.48 s</td>
<td class="left">1.19 s</td>
</tr>
</tbody>
</table>

<p>
Surprisingly to me, our data shows that this method performs worse than the pthreads 1.
This may be due to the scheduling of the threads. 
Threads with lower IDs should have higher priority but this is not the case.
Moving forward, maybe we should restrict the number of threads created to the number of cores of the machine we are using.
</p>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">OpenMP</h3>
<div class="outline-text-3" id="text-3-4">
<p>
The OpenMP algorithm computes the elimination similar to the first pthread implementation. 
The major difference is that the number of threads is specified by:
</p>
<ul class="org-ul">
<li>#pragma omp parallel num_threads(8)  default(shared) private(j,col,mult)
</li>
</ul>
<p>
Then after each round, the threads synchronize.
</p>
<ul class="org-ul">
<li>#pragma omp barrier
</li>
<li>#pragma omp single
</li>
</ul>
<p>
Then the threads are used in subsequent rounds again in the for loop.
</p>

<p>
Empirical data shows on Linux falcon 3.16.0-4-amd64 #1 SMP Debian 3.16.39-1+deb8u1 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">N</th>
<th scope="col" class="left">1</th>
<th scope="col" class="left">10</th>
<th scope="col" class="left">50</th>
<th scope="col" class="left">100</th>
<th scope="col" class="left">500</th>
<th scope="col" class="left">700</th>
<th scope="col" class="left">1000</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">avg_time_openMP</td>
<td class="left">0.0002 s</td>
<td class="left">0.031 s</td>
<td class="left">0.142 s</td>
<td class="left">0.299 s</td>
<td class="left">2.13 s</td>
<td class="left">4.1 s</td>
<td class="left">7.8 s</td>
</tr>

<tr>
<td class="left">avg_time_pthreads 2</td>
<td class="left">0.0002 s</td>
<td class="left">0.035 s</td>
<td class="left">0.87 s</td>
<td class="left">3.31 s</td>
<td class="left">50.2 s</td>
<td class="left">94.8 s</td>
<td class="left">x</td>
</tr>

<tr>
<td class="left">avg_time_pthreads 1</td>
<td class="left">0.017 ms</td>
<td class="left">2.1 ms</td>
<td class="left">39 ms</td>
<td class="left">153 ms</td>
<td class="left">4100 ms</td>
<td class="left">8650 ms</td>
<td class="left">x</td>
</tr>

<tr>
<td class="left">avg_time_seq</td>
<td class="left">0.0002 s</td>
<td class="left">0.0006 s</td>
<td class="left">0.0038 s</td>
<td class="left">0.0135 s</td>
<td class="left">0.48 s</td>
<td class="left">1.19 s</td>
<td class="left">2.05 s</td>
</tr>
</tbody>
</table>

<p>
I think that because the openMP implementation uses only 8 threads its performance is better than the pthreads implemenations.
To make the pthreads implementations better we can restrict the number of threads created.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">References:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://computing.llnl.gov/tutorials/pthreads/">https://computing.llnl.gov/tutorials/pthreads/</a>
</li>
<li><a href="http://pubs.opengroup.org/onlinepubs/7908799/xsh/semaphore.h.html">http://pubs.opengroup.org/onlinepubs/7908799/xsh/semaphore.h.html</a>
</li>
<li><a href="https://stackoverflow.com/questions/459691/best-timing-method-in-c">https://stackoverflow.com/questions/459691/best-timing-method-in-c</a>
</li>
<li><a href="http://mathworld.wolfram.com/GaussianElimination.html">http://mathworld.wolfram.com/GaussianElimination.html</a>
</li>
<li><a href="https://github.com/gmendonca/gaussian-elimination-pthreads-openmp">https://github.com/gmendonca/gaussian-elimination-pthreads-openmp</a>
</li>
<li><a href="http://www.math-cs.gordon.edu/courses/ma342/handouts/gauss.pdf">http://www.math-cs.gordon.edu/courses/ma342/handouts/gauss.pdf</a>
</li>
<li><a href="http://ehneilsen.net/notebook/orgExamples/org-examples.html">http://ehneilsen.net/notebook/orgExamples/org-examples.html</a>
</li>
<li><a href="http://homepages.math.uic.edu/~jan/mcs572/parallelLU.pdf">http://homepages.math.uic.edu/~jan/mcs572/parallelLU.pdf</a>
</li>
<li><a href="https://computing.llnl.gov/tutorials/openMP/">https://computing.llnl.gov/tutorials/openMP/</a>
</li>
<li><a href="https://computing.llnl.gov/tutorials/openMP/samples/C">https://computing.llnl.gov/tutorials/openMP/samples/C</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christopher Hannon</p>
<p class="date">Created: 2017-10-04 Wed 13:24</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
